app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "サッカーボール"], ["price", 1000], ["quantity", 20], ["created_at", 2017-04-07 12:57:49 UTC], ["updated_at", 2017-04-07 12:57:49 UTC]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 900], ["updated_at", 2017-04-08 11:25:13 +0900], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)